from aiogram.enums import ParseMode

from app.client_bot.user_interface.message_templates import TextWithImage, Text


class Single_message2(Text):
    parse_mode= ParseMode.MARKDOWN_V2

    text = """
Только 3% селлеров зарабатывают больше 1 млн

Остальные еле сводят концы с концами\. ||А кто\-то и вовсе работает в минус\.||

Как правило, селлеры совершают одни и те же ошибки⤵️
\- _не считают юнит\-экономику
\- не умеют распродавать остатки и уходят в минуса с залежавшимся товаром 
\- не знают точно, сколько они реально зарабатывают
\- не понимают, как выйти и удержаться в ТОПе_

➡️ Если вы пришли на WB за деньгами, а не поиграть в предпринимателей, обязательно [применяйте рекомендации селлера Максима Плугаря\.](https://t.me/x11_DVB_bonus_bot?start=dvb_1)Его обороты и чистая прибыль бьют все рекорды на WB\!

😱 В закрытом канале Максим отдает самые рабочие инструменты, которые помогут уже сейчас сделать x2 к чистой выручке, как распродать остатки В ПЛЮС и получите прибыльную стратегию на 2025 год\.

Получить доступ: [ЗДЕСЬ](https://t.me/x11_DVB_bonus_bot?start=dvb_1)
     """


class Single_message3(Text):

    parse_mode= ParseMode.MARKDOWN_V2



    text = """
Здравствуйте\! 
Вышла свежая инструкция по использованию данного бота и продвижению вообще\.
[Видео по ссылке на канале поддержки](https://t.me/auto_wb_master/469)
     """


class Single_message4(TextWithImage):
    parse_mode= ParseMode.MARKDOWN_V2

    image = 'images_for_sendings/2.jpg'

    text = """
*Старая уловка экспертов на которую ведётся 93% селлеров 👇*

_Они клянутся, что раскрыли СЕКРЕТ алгоритмов Wildberries и научат вас запускать карточки в ТОП за неделю\.\.\. _

Но на деле продают очередной горе\-курс с бесполезной информацией\. 

*Мы устали смотреть на это\, поэтому решили провести [свой эфир](https://t.me/start_nawb_bot?start=link_LTkblC5KiE) про выход в ТОП на Wildberries\. *

_И сделали его бесплатным — назло всем экспертам\. _

*Что будет?*

Селлер с месячным оборотом 40 млн рублей покажет\, КАК его команда выводит карточку товара в ТОП\.

А самое главное\, поделился своей СИСТЕМОЙ\. 

_\(это когда вы не надеетесь на чудо\, а заранее знаете весь алгоритм действий по выходу в ТОП\)\. _

Всем\, чьи карточки болтаются ниже третьего места выдачи — быть обязательно\. 

Дата эфира — 5 декабря в 14:00 по МСК\. 

Бронируйте своё бесплатное место — [@start_nawb_bot](https://t.me/start_nawb_bot?start=link_LTkblC5KiE)

🎁 P\.S\. Для самых быстрых\, SEO\-cервис\, биддер и инструмент для A\|B теста CTR — в подарок\.    
    """


class Single_message5(Text):
    text = """
Как продвигать товары на WB  с помощью бота WBGRAM Lite, свежее видел -> https://t.me/wbgram_disc/865    
    
    
    """
class Single_message6(TextWithImage):

    parse_mode= ParseMode.MARKDOWN_V2

    image = 'images_for_sendings/3.jpg'

    text = """Делюсь интересным кейсом: занимались продвижением 4 позиций по ВЧ\-запросу \(спортивные костюмы для мальчика\)\.

*Итог: все 4 позиции клиента крутятся в топе WB СУЩЕСТВЕННО дешевле, чем у конкурентов, наши ставки ниже в 3\-4 раза\!*

*Хотите также? Пользуйтесь ботом WBGRAM Lite или заказывайте у нас услуги аутсорсинга продвижения карточек\.* \(@skyline360\_1 , предложение ограничено\)"""

