from aiogram.enums import ParseMode

from app.client_bot.user_interface.message_templates import TextWithImage


class Single_message1(TextWithImage):
    parse_mode= ParseMode.MARKDOWN_V2

    image = 'images_for_sendings/2.jpg'

    text = """
❗ *Тест\-драйв "Продвижение под ключ"* ❗

✨ Хотите испытать всю мощь бота WBGRAM Lite 🚀, но не уверены, будет ли продаваться ваш товар? 🛍

Запускаем услугу: Тест\-драйв "Продвижение под ключ"\! 💥

🎯 *Что это такое:*

1️⃣ Наша команда возьмёт вашу карточку на продвижение на целую неделю 🗓 совершенно бесплатно \(вам нужно только оплатить бот WBGRAM Lite на этот период\) 💸\.

2️⃣ На протяжении этого времени мы будем активно продвигать вашу карточку 🔥\.

3️⃣ По завершению этого срока вам станет ясно: подходит ли WBGRAM Lite для вашего товара или нет 🤔\.

4️⃣ Далее вы можете выбрать: продвигать товар самостоятельно с помощью бота или заключить договор на продвижение "под ключ" 🤝\.

🚫 *Ограничения:*

    ||1\. Один клиент  — одна карточка ☝️\.
    2\. Должны быть остатки на складе \(FBO\) 📦\.
    3\. Предложение актуально только для первых трёх желающих 🥇🥈🥉\.||
    

    Поспешите\! ⏰ Менеджер уже ждёт ваших заявок\! 📲 \-\> ||@elena\_v\_moskve||
     """