from aiogram.enums import ParseMode

from app.client_bot.user_interface.message_templates import TextWithImage, Text


class Single_message2(Text):
    parse_mode= ParseMode.MARKDOWN_V2

    text = """
Только 3% селлеров зарабатывают больше 1 млн

Остальные еле сводят концы с концами\. ||А кто\-то и вовсе работает в минус\.||

Как правило, селлеры совершают одни и те же ошибки⤵️
\- _не считают юнит\-экономику
\- не умеют распродавать остатки и уходят в минуса с залежавшимся товаром 
\- не знают точно, сколько они реально зарабатывают
\- не понимают, как выйти и удержаться в ТОПе_

➡️ Если вы пришли на WB за деньгами, а не поиграть в предпринимателей, обязательно [применяйте рекомендации селлера Максима Плугаря\.](https://t.me/x11_DVB_bonus_bot?start=dvb_1)Его обороты и чистая прибыль бьют все рекорды на WB\!

😱 В закрытом канале Максим отдает самые рабочие инструменты, которые помогут уже сейчас сделать x2 к чистой выручке, как распродать остатки В ПЛЮС и получите прибыльную стратегию на 2025 год\.

Получить доступ: [ЗДЕСЬ](https://t.me/x11_DVB_bonus_bot?start=dvb_1)
     """


class Single_message3(Text):

    parse_mode= ParseMode.MARKDOWN_V2



    text = """
Здравствуйте\! 
Вышла свежая инструкция по использованию данного бота и продвижению вообще\.
[Видео по ссылке на канале поддержки](https://t.me/auto_wb_master/469)
     """