from aiogram.enums import ParseMode

from app.client_bot.user_interface.message_templates import TextWithImage, Text


class Single_message1(Text):
    parse_mode= ParseMode.HTML

    text = """
    
    
📢 Привет! Это Андрей, основатель сервиса WBGRAM. И я с хорошими новостями!

Я собрал обратную связь от наших постоянных пользователей и тех, кто перестал пользоваться ботом. Основная проблема в сервисе — сложная настройка.

💡 Решение
С одной стороны, это закономерно, ведь в сервис заложена сложная логика алгоритмов ВБ. Поэтому он так эффективен для роста ROI и снижения затрат.
С другой стороны, я понимаю, что его можно сделать проще и понятнее. И я сделал!

🔥 Представляю новый сервис — @Sellerspub_bot

Для его создания я вошел в партнерство с Владиславом @Vadyanc — экспертом в маркетинге и руководителем рекламного агентства для маркетплейсов.

🚀 Что нового в @Sellerspub_bot?
✅ Стабильная работа
✅ Статистика по заказам
✅ 2 подробные инструкции по настройке
✅ Канал с полезными вебинарами — @sellerspub

💎 Специальное предложение
Чтобы упростить работу, мы добавили услугу внедрения:
🔹 Мы бесплатно поможем вам настроить сервис и оптимизировать РК при оплате до 14 марта
🔹 Пользователи уже сокращают цену заказа в 4 раза после подключения сервиса, тратя 1 минуту в день на работу с АРК
🔹 При оплате до 14 марта мы удвоим баланс бота, поможем с настройкой, а если за месяц не увидите роста эффективности — вернем деньги!

💰 Как получить бонус?
После оплаты напишите @Vadyanc с текстом: Оплачено

🔗 Регистрируйтесь прямо сейчас: @Sellerspub_bot
        


""".strip()