from aiogram.enums import ParseMode

from app.client_bot.user_interface.message_templates import Text




class Message(Text):
    def __init__(self, bot, chat_id: int):
        super().__init__(bot, chat_id)
        self.parse_mode: str = ParseMode.HTML

    text = """
У вас сейчас в сервисе WB Skyline баланс 0 или минус — поэтому система не работает и вы ей не пользуетесь. Обычно причина одна из двух:
— попробовали, не разобрались и бросили
— сначала работало, потом стало непонятно, что происходит

Сервис WB Skyline за последние месяцы изменился по сути, а не “косметически”:
— Wildberries теперь передаёт данные по каждому ключу (корзины, заказы) → решения принимаются точнее
— ставки управляются по каждому ключу отдельно → меньше ручного хаоса и случайного слива

Сразу честно: сервис не обязан приносить прибыль. Его задача — контроль слива, дисциплина ставок и предсказуемое управление рекламой. Если карточка слабая — чудес не будет, но контроль всё равно экономит деньги.

Чтобы у вас не было ситуации «пополнил и не понял, что дальше», я готов лично и бесплатно:
— посмотреть ваш магазин
— выставить базовые настройки
— корректно запустить сервис
Никаких дополнительных платежей за это нет. С вас — только пополнение баланса в сервисе.

⚠️ Ручной запуск — это бонус за оплату: я беру только первые 3 магазина, кто пополнит баланс от 5 000 ₽ и напишет мне.

✅ Зайдите в бот → нажмите Старт → выберите магазин → 💰 Пополнить баланс (минимальная сумма пополнения — 5 000 ₽)

После пополнения напишите мне «ЗАПУСК» в @skyline360_1 — подключусь и настрою старт.

    """.strip()
