from app.settings import settings


def get_main_text():

    text = """
Я бот для автоматизации внутренней рекламы на Wildberries.

👨🏼‍💼Что я умею:
—  сам понимаю, какие ключи для вас будут наиболее эффективны, включая их в РК

— отключаю большинство нерелевантных запросов с первого показа

— использую искусственный интеллект и математические модели для управления РК

— в итоге самостоятельно вывожу ваши основные ключи в ТОП.

🤝Со мной вы:
— экономите до 90% рекламного бюджета

— увеличиваете конверсию и снижаете стоимость клика

— тратите несколько минут вместо нескольких дней на настройку РК

— повышаете эффективность вашей рекламы минимум на 50% 

⚙️Начало работы:
—  Если у вас еще нет магазинов, то жмите "Добавить магазин" и следуйте инструкциям.

—  Бот крайне прост в использовании: достаточно один раз его настроить, нажав несколько кнопок.

💰Стоимость бота:
— 300 рублей за комплекс рекламных кампаний (Авто и Аукцион). Если вы не увидите эффективность, мы вернем вам деньги.
\n
"""
    if settings.version == 'my':
        text += """
📩Важные ресурсы:\n
Телеграм-канал бота  — https://t.me/auto_wb_master
Телеграм-группа поддержки - https://t.me/reklama_na_wb_dlya_vseh
        
        """


    elif settings.version == 'partner':
        text += """📩Дополнительные ресурсы:\n
Самая актуальная информация и подробная инструкция на канале — https://t.me/sellerspub

По любым вопросам писать - @vadyanc        
        
        """

    return text













