from app.client_bot import const


def get_main_text(user_telegram_id: int) -> str:
    text = f"""
Бот для автоматического управления рекламой на Wildberries

Я помогаю вести рекламу в заданных экономических рамках и снижать ручную нагрузку.

Что делает бот

— управляет рекламными кампаниями через план продаж
— отбирает и удерживает экономически оправданные запросы
— ограничивает неэффективный трафик и перерасход бюджета
— использует заказы и корзины как рабочие сигналы
— автоматически поддерживает кампании в актуальном состоянии

Как работает

— вы задаёте целевые параметры (себестоимость и объём продаж)
— бот сам управляет рекламой в этих рамках
— не требует ежедневного ручного контроля

Начало работы

— добавьте магазин и следуйте инструкциям
— настройка занимает несколько минут

Стоимость

— от 500 ₽ за артикул
(две кампании: авто + аукцион)

📩Дополнительные ресурсы:

По любым вопросам писать — {const.SUPPORT_LINK}

Ваш telegram id: {user_telegram_id}
"""

    return text
