

def get_main_text(user_telegram_id: int) -> str:
    text = f"""
Ваш Телеграм ID: {user_telegram_id}\n

📈 Экономическое управление рекламой на Wildberries \n
Я управляю рекламой на Wildberries через экономику, а не через бесконечные ручные правки.

🤖 Бот автоматически создаёт и ведёт поисковую рекламу и авторекламу:
• 🔎 подбирает запросы и кластеры
• 💸 регулирует ставки и работу в аукционе
• 🔁 перераспределяет трафик между кампаниями

🚀 Этап набора объёма
Бот усиливает самые эффективные запросы, чтобы выйти к плану продаж.

🎯 Этап оптимизации
После достижения объёма переключается в режим экономии: снижает расходы, двигаясь к целевой себестоимости заказа.

🧯 Если расход выходит за рамки
Сначала бот отключает самый дорогой и наименее эффективный трафик, оставляя лучшие запросы.
Если этого недостаточно — дополнительно снижает ставки.

⛔️ Если реклама “не крутится”
Чаще это связано с настройками, бюджетом или лимитами, а не с “поломкой” ✅
"""

    return text
