from app.client_bot import const


def get_main_text(user_telegram_id: int):
    text = f"""
Я бот-партнер в автоматизации рекламы на Wildberries: для агентств и крупных селлеров. 

👨🏼‍💼Я создан, чтобы сократить время на настройку и оптимизацию большого количества кампаний. В меня заложена сама логика работы алгоритмов ВБ, поэтому я могу самостоятельно выводить товары в ТОП и при этом сократить рекламные затраты. 

Как? <a href="https://drive.google.com/file/d/1ipUdoYaHT9CciWa3AclU8C8hTZ7NZ-S5/view">Смотрите в презентации</a>


🤝Что умею конкретно:

— сам понимаю, какие ключи для вас будут наиболее эффективны, включая их в РК

— отключаю большинство нерелевантных запросов с первого показа

— использую искусственный интеллект и математические модели для управления РК

— управляю ставкой с учетом выбранной стратегии

⚙️Начало работы:

— Если у вас еще нет магазинов, то жмите "Добавить магазин" и следуйте инструкциям.

— Бот крайне прост в использовании: достаточно один раз его настроить, нажав несколько кнопок.

💰Стоимость бота:

— от 299 рублей за один артикул (две РК (авто и аукцион), которые будут работать в связке)

📩Дополнительные ресурсы:

Самая актуальная информация на канале — https://t.me/sellerspub

Подробные инструкции по работе с ботом — https://t.me/sellerspub/175

По любым вопросам писать — {const.SUPPORT_LINK}

Ваш telegram id: {user_telegram_id}
"""

    return text
